# St7GetNumLSACombinations

Returns the number of linear load case combinations in the specified model for solver-generated .LSA files.

long St7GetNumLSACombinations(long uID, long* NumCases)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
NumCases

Number of linear load case combinations.